<?php

/*-------------------------------------------------

	--> 日本語のストアカテゴリ名を英語に変換

-------------------------------------------------*/

function translate_store_category_to_en($name)
{
  return empty($name) ? 'Store' : array(
    '常設店舗' => 'Store',
    '期間限定店舗' => 'Pop-up Store',
  )[$name];
}

/*-------------------------------------------------

	--> 日本語のストアカテゴリ名を英語に変換

-------------------------------------------------*/

function format_date_to_short($date)
{
  return preg_replace('/(\d+)年(\d+)月(\d+)日/i', '${1}/${2}/${3}', $date);
}
